# basic of pandas library-data manupalitation and buiding ml models and data visualisation
# Used for data structure- series and dataframes

# pandas Series
## important pandas library
## to create series object, used pd.series()
## Each column in dataframe is pandas series

In [1]:
# import pandas
import pandas as pd

In [4]:
# creating a character series from tuple

char_series = pd.Series(('K','A','S','H','I'))
char_series

0    K
1    A
2    S
3    H
4    I
dtype: object

In [6]:
# creating series from list

num_series = pd.Series([3,6,45,23,56])
print(num_series)
print(type(num_series))

0     3
1     6
2    45
3    23
4    56
dtype: int64
<class 'pandas.core.series.Series'>

In [11]:
# creating datetime.series
date_series = pd.date_range(start= '01-02-2023',end ='30-12-2023')
print(date_series)
print(type(date_series))

DatetimeIndex(['2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05',
               '2023-01-06', '2023-01-07', '2023-01-08', '2023-01-09',
               '2023-01-10', '2023-01-11',
               ...
               '2023-12-21', '2023-12-22', '2023-12-23', '2023-12-24',
               '2023-12-25', '2023-12-26', '2023-12-27', '2023-12-28',
               '2023-12-29', '2023-12-30'],
              dtype='datetime64[ns]', length=363, freq='D')
<class 'pandas.core.indexes.datetimes.DatetimeIndex'>

In [17]:
# indexing
print(num_series[4])
print("\n")
print(num_series[1:4])
print("\n ")
print(num_series[[1,4]])

56


1     6
2    45
3    23
dtype: int64


1     6
4    56
dtype: int64

In [18]:
# setting up index explectily
# Use index argument while getting argument
num_series = pd.Series([3,4,5,6,7], index = ['a','b','c','d','e'])
num_series

a    3
b    4
c    5
d    6
e    7
dtype: int64

In [20]:
# another way of defining index
import numpy as np
series1 = pd.Series(np.array(range(0,5))+2, index = range(0,5))
series1

0    2
1    3
2    4
3    5
4    6
dtype: int32

# The Pandas Dataframe
## Dataframe - it is a table with rows and columns
## Rows having an index and column having meaningful names

# creating DataFrames

## ways to create dataframe are:
## from dictionaries
## JSON objects
## Reading from CSV files, flat files or txt files etc

In [7]:
# using dictionary , creating dataframe

basket_df = pd.DataFrame({'fuits':['Banana','Guva','Orange','apple','Kiwi'],
                         'weight':[12,13,24,2,8],
                         'Color':['Yellow','Green','Pale Yellow','Red','Brown']})
basket_df

    fuits  weight        Color
0  Banana      12       Yellow
1    Guva      13        Green
2  Orange      24  Pale Yellow
3   apple       2          Red
4    Kiwi       8        Brown

In [ ]:
# reading a csv file as a dataframe
basket_df = pd.read_csv("/location/path.csv")
baket_df

In [34]:
kashi_collect_df = pd.DataFrame({'Student_name':['Binod khatri','Madan Karki','Diraj Oja','Dilip Panday','Bindod Khadka','kashi bhattarai'],
                                'student_age':[12,13,34,55,12,25],
                                'Grade':['A','A+','B','B+','C+','A++']})
kashi_collect_df

      Student_name  student_age Grade
0     Binod khatri           12     A
1      Madan Karki           13    A+
2        Diraj Oja           34     B
3     Dilip Panday           55    B+
4    Bindod Khadka           12    C+
5  kashi bhattarai           25   A++

In [5]:
# reading from the excel files as a dataframe
basket_df = pd.read_excel("C:/location/path.fruits_data.xlsx")
basket_df

## play with dataframe

In [19]:
# finding datatypes of each column
kashi_collect_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Student_name  6 non-null      object
 1   student_age   6 non-null      int64
 2   Grade         6 non-null      object
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [35]:
# dimensions of dataframe(rows and column)
kashi_collect_df.shape

(6, 3)

In [36]:
# glance at top and bottom records of dataframe
# it will dislay top 5 rows
kashi_collect_df.head()

    Student_name  student_age Grade
0   Binod khatri           12     A
1    Madan Karki           13    A+
2      Diraj Oja           34     B
3   Dilip Panday           55    B+
4  Bindod Khadka           12    C+

In [37]:
# it will display bottom to top five rows
kashi_collect_df.tail()

      Student_name  student_age Grade
1      Madan Karki           13    A+
2        Diraj Oja           34     B
3     Dilip Panday           55    B+
4    Bindod Khadka           12    C+
5  kashi bhattarai           25   A++

In [38]:
# summary of all the numeric column in the dataframe
kashi_collect_df.describe()

       student_age
count     6.000000
mean     25.166667
std      17.104580
min      12.000000
25%      12.250000
50%      19.000000
75%      31.750000
max      55.000000

In [39]:
# finding the column names
kashi_collect_df.columns

Index(['Student_name', 'student_age', 'Grade'], dtype='object')

In [40]:
# extracting the values of dataframe as a numpy array using dataframe.values
kashi_collect_df.values

array([['Binod khatri', 12, 'A'],
       ['Madan Karki', 13, 'A+'],
       ['Diraj Oja', 34, 'B'],
       ['Dilip Panday', 55, 'B+'],
       ['Bindod Khadka', 12, 'C+'],
       ['kashi bhattarai', 25, 'A++']], dtype=object)

In [41]:
# indexing with your own values
kashi_collect_df.head()

    Student_name  student_age Grade
0   Binod khatri           12     A
1    Madan Karki           13    A+
2      Diraj Oja           34     B
3   Dilip Panday           55    B+
4  Bindod Khadka           12    C+

In [42]:
# set Grade as index
kashi_collect_df.set_index('Grade',inplace =True)
kashi_collect_df.head()

        Student_name  student_age
Grade
A       Binod khatri           12
A+       Madan Karki           13
B          Diraj Oja           34
B+      Dilip Panday           55
C+     Bindod Khadka           12

In [43]:
# you can reset index as well
# whenere as inplace = True the index in dataframe will performed parmanent
# when we use inplace = false, it will use it as temporary